Tekla.Structures.Model.RebarLapping
The RebarLapping class represents the lapping of reinforcing bars at a Tekla.Structures.Model.RebarSplitter.

Tekla.Structures.Model.RebarLapping.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarLapping class.

Tekla.Structures.Model.RebarLapping.LapLength
Gets or sets the lap length.
Negative values will define a gap rather than a lap.

Tekla.Structures.Model.RebarLapping.LapSide
Gets or sets the side of the split that the lap is located.

Tekla.Structures.Model.RebarLapping.LapPlacement
Gets or sets the placement of the lap relative to the associated Tekla.Structures.Model.RebarLegFace.

Tekla.Structures.Model.RebarLapping.LappingType
Gets or sets the lapping type.